In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
# Return a series of boolean value
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
# dropna - filter axis label based on if there are missing data
# fillna - fill in missing data with some value
# isnull - return boolean series indicating which value is missing/NA
# notnull - negation of isnull

In [7]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
# dropna() is the same as
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3]])

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.rand(7, 3))

In [16]:
# From the start to 4th row, column index = 1
df.iloc[:4, 1] = NA

# From the start to the 2nd row, column index = 2
df.iloc[:2, 2] = NA

In [17]:
df

          0         1         2
0  0.882099       NaN       NaN
1  0.939099       NaN       NaN
2  0.492153       NaN  0.157831
3  0.743029       NaN  0.122974
4  0.104873  0.781275  0.899272
5  0.514724  0.709034  0.533159
6  0.490141  0.955146  0.693192

In [18]:
df.dropna()

          0         1         2
4  0.104873  0.781275  0.899272
5  0.514724  0.709034  0.533159
6  0.490141  0.955146  0.693192

In [19]:
df.dropna(thresh=2)

          0         1         2
2  0.492153       NaN  0.157831
3  0.743029       NaN  0.122974
4  0.104873  0.781275  0.899272
5  0.514724  0.709034  0.533159
6  0.490141  0.955146  0.693192

In [20]:
df.fillna(0)

          0         1         2
0  0.882099  0.000000  0.000000
1  0.939099  0.000000  0.000000
2  0.492153  0.000000  0.157831
3  0.743029  0.000000  0.122974
4  0.104873  0.781275  0.899272
5  0.514724  0.709034  0.533159
6  0.490141  0.955146  0.693192

In [21]:
# call fillna with a dict and use different fill value for each column
df.fillna({1: 0.5, 2:0})

          0         1         2
0  0.882099  0.500000  0.000000
1  0.939099  0.500000  0.000000
2  0.492153  0.500000  0.157831
3  0.743029  0.500000  0.122974
4  0.104873  0.781275  0.899272
5  0.514724  0.709034  0.533159
6  0.490141  0.955146  0.693192

In [22]:
_ = df.fillna(0, inplace=True)

In [23]:
df

          0         1         2
0  0.882099  0.000000  0.000000
1  0.939099  0.000000  0.000000
2  0.492153  0.000000  0.157831
3  0.743029  0.000000  0.122974
4  0.104873  0.781275  0.899272
5  0.514724  0.709034  0.533159
6  0.490141  0.955146  0.693192

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))

In [25]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [26]:
df

          0         1         2
0 -0.685665 -0.306925  0.812099
1 -0.425444 -0.847547  0.149864
2  0.721986       NaN  0.442721
3  2.053981       NaN  1.683734
4 -0.547137       NaN       NaN
5  1.479279       NaN       NaN

In [27]:
df.fillna(method='ffill')

          0         1         2
0 -0.685665 -0.306925  0.812099
1 -0.425444 -0.847547  0.149864
2  0.721986 -0.847547  0.442721
3  2.053981 -0.847547  1.683734
4 -0.547137 -0.847547  1.683734
5  1.479279 -0.847547  1.683734

In [28]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.685665 -0.306925  0.812099
1 -0.425444 -0.847547  0.149864
2  0.721986 -0.847547  0.442721
3  2.053981 -0.847547  1.683734
4 -0.547137       NaN  1.683734
5  1.479279       NaN  1.683734

In [29]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [30]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [31]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data['v1'] = range(7)

In [35]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [38]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'Pastrami', 'honey ham', 'noval lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8    noval lox     6.0

In [39]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'honey ham': 'pig',
    'noval lox': 'salmon',
    'corned beef': 'cow'
}

In [40]:
lowercased = data['food'].str.lower()

In [41]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8      noval lox
Name: food, dtype: object

In [42]:
data['animal'] = lowercased.map(meat_to_animal)

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8    noval lox     6.0  salmon

In [44]:
# Smarter / advanced way
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
data = pd.Series([1., -999, 2., -999., -1000., 3.])

In [46]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
data.replace([-999, -1000], [NA, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data.replace({-999: NA, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [52]:
transform = lambda x: x[:4].upper()

In [53]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [54]:
# Modifying the DataFrame in-place:
data.index = data.index.map(transform)

In [55]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [56]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [57]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [58]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [59]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [60]:
# Discretization and Binning

In [61]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# Use a cut function in pandas
bins = [18, 25, 35, 60, 100]

In [62]:
cats = pd.cut(ages, bins)

In [63]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [65]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [68]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [69]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [73]:
data = np.random.rand(20)

In [74]:
pd.cut(data, 4, precision=2)

[(0.74, 0.95], (0.12, 0.33], (0.74, 0.95], (0.33, 0.53], (0.12, 0.33], ..., (0.74, 0.95], (0.12, 0.33], (0.12, 0.33], (0.74, 0.95], (0.33, 0.53]]
Length: 20
Categories (4, interval[float64]): [(0.12, 0.33] < (0.33, 0.53] < (0.53, 0.74] < (0.74, 0.95]]

In [75]:
data = np.random.randn(1000)

In [77]:
cats = pd.qcut(data, 4)

In [78]:
cats

[(0.0265, 0.659], (0.659, 3.069], (0.659, 3.069], (0.0265, 0.659], (0.659, 3.069], ..., (-0.654, 0.0265], (-0.654, 0.0265], (-0.654, 0.0265], (0.659, 3.069], (0.659, 3.069]]
Length: 1000
Categories (4, interval[float64]): [(-2.8089999999999997, -0.654] < (-0.654, 0.0265] < (0.0265, 0.659] < (0.659, 3.069]]

In [79]:
pd.value_counts(cats)

(0.659, 3.069]                   250
(0.0265, 0.659]                  250
(-0.654, 0.0265]                 250
(-2.8089999999999997, -0.654]    250
dtype: int64

In [81]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0265, 1.349], (1.349, 3.069], (0.0265, 1.349], (0.0265, 1.349], (0.0265, 1.349], ..., (-1.275, 0.0265], (-1.275, 0.0265], (-1.275, 0.0265], (1.349, 3.069], (0.0265, 1.349]]
Length: 1000
Categories (4, interval[float64]): [(-2.8089999999999997, -1.275] < (-1.275, 0.0265] < (0.0265, 1.349] < (1.349, 3.069]]

In [82]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [83]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.026989    -0.018363     0.008999     0.036262
std       1.034399     1.009396     0.994432     0.986103
min      -3.510638    -3.391049    -3.040735    -3.219955
25%      -0.659239    -0.665693    -0.676028    -0.651277
50%       0.025658     0.012483     0.036415     0.067166
75%       0.741031     0.670151     0.667081     0.725236
max       3.322455     2.965771     2.998186     2.743786

In [84]:
# Find the values in one of the columns exceeding 3 in absoulate value
col = data[2]

In [86]:
col.head(5)

0    0.498429
1    1.956704
2   -0.026987
3    0.702766
4    0.793961
Name: 2, dtype: float64

In [87]:
# Filter the rows where absolute values > 3
col[np.abs(col) > 3]

532   -3.040735
742   -3.010044
Name: 2, dtype: float64

In [89]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
32   3.078112  0.326231  0.645312  0.437336
227 -0.991581 -3.140341 -0.174856  0.612124
260  0.257104  1.185664  0.458828 -3.219955
532  0.339962  1.495870 -3.040735 -0.628972
578 -3.118253  0.192435 -0.700315  0.115936
613  3.322455  0.673940  0.566585 -0.406307
660  0.428992 -3.034519  0.780140  0.323362
697  0.806775 -3.391049 -2.488640 -0.517856
742 -1.058883 -0.786706 -3.010044  1.370965
779 -3.510638  0.123781 -1.276427  1.514162
849  3.241855  1.289714 -0.432042  0.595253
930 -3.048911 -1.372036 -1.617722 -0.538993

In [90]:
# Cap the values between -3 and 3
data[np.abs(data) > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.027024    -0.017797     0.009049     0.036482
std       1.030342     1.007635     0.994277     0.985400
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.659239    -0.665693    -0.676028    -0.651277
50%       0.025658     0.012483     0.036415     0.067166
75%       0.741031     0.670151     0.667081     0.725236
max       3.000000     2.965771     2.998186     2.743786

In [92]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0  1.0 -1.0

In [95]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [96]:
sampler = np.random.permutation(5)

In [98]:
sampler

array([1, 3, 2, 0, 4])

In [99]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [100]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [105]:
# or using the old method
df.iloc[sampler]

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [106]:
# or yet another way
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [109]:
# Get sample with replacement
choice = pd.Series([5, 7, -1, 6, 4])
draws = choice.sample(n=10, replace=True)
draws

1    7
0    5
3    6
0    5
1    7
2   -1
2   -1
3    6
4    4
4    4
dtype: int64

In [110]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [111]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [112]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [115]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [116]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [121]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_csv('./pydata-book/datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')

In [123]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [124]:
# Get the list of unique genres in the dataset
all_genres = []

# Looping the array of genres
for x in movies.genres:
    # Appending a list of genres into the master list (all_genres)
    all_genres.extend(x.split('|'))

In [131]:
# A quick way to deduplicates and create a nparray
genres = pd.unique(all_genres)

In [132]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [133]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [134]:
zero_matrix.shape

(3883, 18)

In [135]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [138]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [139]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [140]:
# This loop the dataframe one row at a time,
# determine which genre index to set to 1
for i, gen in enumerate(movies.genres):
    # Return a list of indices where the indicator should set to 1
    indices = dummies.columns.get_indexer(gen.split('|'))
    # assign 1 to that position using index locate[] ...
    dummies.iloc[i, indices] = 1

In [141]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [143]:
movies_windic.head(2)

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [144]:
# Combine get_dummies with a descretization function like cut
np.random.seed(12345)

In [145]:
values = np.random.rand(10)

In [147]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [148]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [150]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [151]:
# String Manipulations with Pandas!

In [152]:
# Break the comma separated string into pieces (list of strings)
val = 'a,b,     guide'
val.split(',')

['a', 'b', '     guide']

In [154]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guide']

In [155]:
first, second, third = pieces

In [156]:
first + '::' + second + '::' + third

'a::b::guide'

In [157]:
'::'.join(pieces)

'a::b::guide'

In [159]:
'guide' in val

True

In [160]:
val.index(',')

1

In [162]:
val.find(':')

-1

In [163]:
val.count(',')

2

In [164]:
val.replace(',', '::')

'a::b::     guide'

In [166]:
val.replace(',', '')

'ab     guide'

In [167]:
import re
text = 'foo      bar\t  baz \tqux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [168]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [169]:
regex.findall(text)

['      ', '\t  ', ' \t']

In [179]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-0.-]+\.[A-Z]{2,4}'

# re.IGNORECASE make the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [171]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [173]:
m = regex.search(text)

In [174]:
text[m.start():m.end()]

'dave@google.com'

In [175]:
m.group()

'dave@google.com'

In [176]:
print(m)

<re.Match object; span=(6, 21), match='dave@google.com'>

In [177]:
print(regex.match(text))

None

In [180]:
print(regex.sub('*'*10, text))

Dave **********
Steve **********
Rob **********
Ryan **********

In [185]:
pattern = r'([A-Z0-0]+)@([A-Z0-9]+)\.([A-Z]{2,4})'

In [187]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [188]:
m = regex.match('wesm@bright.net')

In [189]:
m.groups()

('wesm', 'bright', 'net')

In [190]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [191]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [192]:
# Vectorized String Function in Pandas
data = {'Dave': 'dave@google.com', 
        'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com',
        'Wes': 'np.nan'}

In [193]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': 'np.nan'}

In [194]:
data = pd.Series(data)

In [195]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes               np.nan
dtype: object

In [196]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes      False
dtype: bool

In [197]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes      False
dtype: bool

In [206]:
pattern = r'([A-Z0-9]+)@([A-Z0-9]+)\.([A-Z0-9]{2,4})'
regex = re.compile(pattern, re.IGNORECASE)

matches = data.str.findall(regex).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [204]:
data.str.findall(regex)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                         []
dtype: object

In [207]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [208]:
# You can use slice too!
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes      np.na
dtype: object

In [209]:
data.str.extract(regex)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [215]:
simple_dict = {'a': {1: 'apple apple'},
               'b': {2: 'banana'},
               'c': {3: 'cat cat cat'}}

df = pd.DataFrame(simple_dict, index=np.arange(3))

In [216]:
df

             a       b   c
0          NaN     NaN NaN
1  apple apple     NaN NaN
2          NaN  banana NaN